#!/bin/bash

# Запитати користувача про перше число
echo "Введіть перше число: "
read num1

# Запитати користувача про друге число
echo "Введть друге число: "
read num2

# Запитати користувача про операцію (додавання або віднімання)
echo "виберіть операцію (+ або -): "
read op

# Виконати операцію відповідно до введеної операції
if [ "$op" == "+" ]; then
  result=$((num1 + num2))
  operation="+"
elif [ "$op" == "-" ]; then
  result=$((num1 - num2))
  operation="-"
else
  echo "Невірна операція!"
  exit 1
fi

# Вивести результат на екран
echo "$num1 $operation $num2 = $result"
